packages/rust-actix-web/results.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ../../script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 43s max duration (incl. graceful stop):
              * delayed_start: 10 looping VUs for 10s (startTime: 3s, gracefulStop: 30s)


running (01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  2.0s

running (02.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  1.0s

running (03.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  0.0s

running (04.0s), 10/10 VUs, 11180 complete and 0 interrupted iterations
delayed_start   [  10% ] 10 VUs  01.0s/10s

running (05.0s), 10/10 VUs, 22460 complete and 0 interrupted iterations
delayed_start   [  20% ] 10 VUs  02.0s/10s

running (06.0s), 10/10 VUs, 33703 complete and 0 interrupted iterations
delayed_start   [  30% ] 10 VUs  03.0s/10s

running (07.0s), 10/10 VUs, 44880 complete and 0 interrupted iterations
delayed_start   [  40% ] 10 VUs  04.0s/10s

running (08.0s), 10/10 VUs, 54341 complete and 0 interrupted iterations
delayed_start   [  50% ] 10 VUs  05.0s/10s

running (09.0s), 10/10 VUs, 66479 complete and 0 interrupted iterations
delayed_start   [  60% ] 10 VUs  06.0s/10s

running (10.0s), 10/10 VUs, 78561 complete and 0 interrupted iterations
delayed_start   [  70% ] 10 VUs  07.0s/10s

running (11.0s), 10/10 VUs, 90505 complete and 0 interrupted iterations
delayed_start   [  80% ] 10 VUs  08.0s/10s

running (12.0s), 10/10 VUs, 101479 complete and 0 interrupted iterations
delayed_start   [  90% ] 10 VUs  09.0s/10s

running (13.0s), 10/10 VUs, 110563 complete and 0 interrupted iterations
delayed_start   [ 100% ] 10 VUs  10.0s/10s

     data_received..................: 71 MB  5.5 MB/s
     data_sent......................: 8.8 MB 681 kB/s
     http_req_blocked...............: avg=1.99µs   min=621ns   med=1.37µs   max=10.4ms   p(90)=1.77µs  p(95)=2.05µs 
     http_req_connecting............: avg=45ns     min=0s      med=0s       max=940.57µs p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=852.15µs min=72.47µs med=606.71µs max=46.46ms  p(90)=1.65ms  p(95)=2.29ms 
       { expected_response:true }...: avg=852.15µs min=72.47µs med=606.71µs max=46.46ms  p(90)=1.65ms  p(95)=2.29ms 
     http_req_failed................: 0.00%  ✓ 0           ✗ 110594
     http_req_receiving.............: avg=34.62µs  min=8.03µs  med=16.2µs   max=37.36ms  p(90)=22.45µs p(95)=36.55µs
     http_req_sending...............: avg=12.9µs   min=3.03µs  med=5.93µs   max=10.6ms   p(90)=8.24µs  p(95)=10.44µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=804.62µs min=51.15µs med=573.31µs max=40.16ms  p(90)=1.58ms  p(95)=2.19ms 
     http_reqs......................: 110594 8506.543968/s
     iteration_duration.............: avg=893.96µs min=98.58µs med=644.87µs max=46.79ms  p(90)=1.7ms   p(95)=2.36ms 
     iterations.....................: 110594 8506.543968/s
     vus............................: 10     min=0         max=10  
     vus_max........................: 10     min=10        max=10  


running (13.0s), 00/10 VUs, 110594 complete and 0 interrupted iterations
delayed_start ✓ [ 100% ] 10 VUs  10s